Agat/src/Catalogs/ЛокальныеАкты/ЛокальныеАкты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЛокальныеАкты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйИсполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Н</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Приложения</name>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Agat/src/Catalogs/ЛокальныеАкты/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Загрузка файлов    //////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общие модули:                                                              //
//   			РаботаСФайламиСервер:                                         //
//										Процедура ПриСозданииНаСервере 		  //
//              РаботаСФайламиКлиент:                                         //
//                                      Асинх Процедура КомандаДействие       //
//                                      Асинх Процедура КомандаУдалить        //
// Константы:                                                                 //
//              ПутьХранилищаФайлов:                                          //
//                                      Адрес файлового хранилища заданного   //
//                                      пользователем (Администратор)         //
// Реквизиты ТЧ:                                                              //
// 				РасширениеФайла - строка                                      //
//				УникальныйИдентификатор - УникальныйИдентификатор             // 
//                                      Присвоение имени файла в архиве HDD   //
// Реквизиты формы:                                                           //
//          	ПутьХранилища - строка                                        //
//                                      Хранение данных Константы:            //
//										ПутьХранилищаФайлов                   //
// Команды:                                                                   //
//          	КомандаДействие - Асинх Процедура КомандаДействие(Команда)    //
//                                (Присоединение / просомтр файла)			  //
//                                 Тригер - Реквизит ТЧ - РасширениеФайла     //
//          	КомандаУдалить  - Асинх Процедура КомандаУдалить(Команда)     //
// События:                                                                   //
//    	Форма:                                                                //
//				Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   //
//      	    Процедура ПриОткрытии(Отказ)             					  //
//      	    Процедура ПослеЗаписи(ПараметрыЗаписи)           			  //
//      	    Процедура ОбновитьКнопкиФайлов()   							  // 
//                                                                            //
// Особенности:                                                               //
//              Присвооение имени выгруженного файла по шаболну:              //
//              РаботаСФайламиКлиент - Функция СформироватьИмяФайлаИзДанных   // 
// шаболн:                                                                    //
//       "%1_№ %2_от %3%4", Назв, Ном, Дат, ТекущиеДанные.РасширениеФайла);	  //
////////////////////////////////////////////////////////////////////////////////

// =============================================================================
// СИСТЕМНЫЕ СОБЫТИЯ ФОРМЫ
// =============================================================================

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// 1. Для формы элемента без ТЧ условное оформление таблиц не требуется.
	// Метод НастроитьОформлениеВсехТаблиц здесь не нужен и может вызвать ошибку.
	
	// 2. Устанавливаем доступность кнопок при открытии карточки.
	// В справочнике без ТЧ префикс (имя ТЧ) передаем пустой "".
//	ОбновитьДоступностьКнопокНаСервере();
	
	// Формируем массив всех табличных частей, которые поддерживают работу с файлами
	МассивТЧ = Новый Массив;
	МассивТЧ.Добавить("Приложения");
	
	// Настраиваем программное условное оформление для отображения иконок (лупа/скрепка) 
	// в колонках ИмяТЧ+"Действие" и ИмяТЧ+"Удалить"
	РаботаСФайламиСервер.НастроитьОформлениеВсехТаблиц(ЭтаФорма, МассивТЧ);
										
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьКнопокНаСервере()
	
	ЕстьФайл = ЗначениеЗаполнено(Объект.РасширениеФайла);
	
	// Если ваши кнопки называются просто "КомандаУдалить" и "КомандаДействие"
	Попытка
		Элементы.КнопкаУдалить.Доступность = ЕстьФайл;
		// Кнопка прикрепления/открытия обычно доступна всегда
		Элементы.КнопкаДействие.Доступность = Истина; 
	Исключение
		// Имена элементов на форме не совпали с именами в коде
	КонецПопытки;
	
КонецПроцедуры

// =============================================================================
// УНИВЕРСАЛЬНЫЕ КОМАНДЫ 
// =============================================================================

&НаКлиенте
Асинх Процедура КомандаДействие(Команда)
	
	// 1. ОПРЕДЕЛЯЕМ КОНТЕКСТ (таблица или шапка)
	ТекущийЭлемент = ЭтаФорма.ТекущийЭлемент;
	ТипТекущегоЭлемента = ТипЗнч(ТекущийЭлемент);
	
	// Проверяем, находимся ли мы в табличной части
	ЭтоТаблица = (ТипТекущегоЭлемента = Тип("ТаблицаФормы"));
	
	// 2. ЛОГИКА ДЛЯ ТАБЛИЦЫ
	Если ЭтоТаблица Тогда
		ИмяТаблицы = ТекущийЭлемент.Имя;
		
		Если Объект[ИмяТаблицы].Количество() = 0 Тогда
			ПоказатьОповещениеПользователя("Внимание", , "Таблица пуста!");
			Возврат;
		КонецЕсли;
		
		Если ТекущийЭлемент.ТекущиеДанные = Неопределено Тогда
			ТекущийЭлемент.ТекущаяСтрока = Объект[ИмяТаблицы].ПолучитьИдентификатор();
		КонецЕсли;
		
		ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
		
	// 3. ЛОГИКА ДЛЯ ШАПКИ (вне таблицы)
	// Работает как при наличии файла, так и при его отсутствии
	Иначе
		ТекущиеДанные = Объект;
		ИмяТаблицы = ""; // Пустая строка показывает, что это шапка
	КонецЕсли;
	
	// 4. ВЫПОЛНЕНИЕ
	Попытка
		Ждать РаботаСФайламиКлиент.ВыполнитьДействиеСФайлом(ЭтаФорма, ТекущиеДанные, ИмяТаблицы);
	Исключение
		ПоказатьПредупреждение(, ОписаниеОшибки());
	КонецПопытки;
	
	РаботаСФайламиКлиент.ОбновитьИнтерфейсКнопок(ЭтаФорма, ТекущиеДанные, ИмяТаблицы);
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура КомандаУдалить(Команда)
	
	ТекущийЭлемент = ЭтаФорма.ТекущийЭлемент;
	ТипТекущегоЭлемента = ТипЗнч(ТекущийЭлемент);
	ЭтоТаблица = (ТипТекущегоЭлемента = Тип("ТаблицаФормы"));
	
	// 1. ЛОГИКА ДЛЯ ТАБЛИЦЫ
	Если ЭтоТаблица Тогда
		ИмяТаблицы = ТекущийЭлемент.Имя;
		ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
		
		Если ТекущиеДанные = Неопределено Тогда 
			Возврат; 
		КонецЕсли;
		
	// 2. ЛОГИКА ДЛЯ ШАПКИ (вне таблицы)
	Иначе
		// Если файла нет - нечего удалять
		Если НЕ ЗначениеЗаполнено(Объект.РасширениеФайла) Тогда 
			ПоказатьОповещениеПользователя("Внимание", , "Нет загруженного файла");
			Возврат; 
		КонецЕсли;
		
		ТекущиеДанные = Объект;
		ИмяТаблицы = "";
	КонецЕсли;
	
	// 3. ПОЛУЧЕНИЕ ПАРАМЕТРОВ
	ДанныеСправочника = ПолучитьДанныеСправочникаНаСервере(Объект.Ссылка);
	
	ИмяСправочника = ДанныеСправочника.ИмяСправочника;
	НаименованиеЭлемента = ДанныеСправочника.Наименование;
	СсылкаНаОбъект = ДанныеСправочника.Ссылка;
	
	ИмяПользователя = "Система";
	Если ЗначениеЗаполнено(Объект.ОтветственныйИсполнитель) Тогда
		ИмяПользователя = ПолучитьИмяСотрудникаНаСервере(Объект.ОтветственныйИсполнитель);
	КонецЕсли;
	
	// 4. УДАЛЕНИЕ
	Попытка
		Ждать РаботаСФайламиКлиент.УдалитьФайл(
				ЭтаФорма, 
				ТекущиеДанные, 
				ИмяТаблицы, 
				ИмяСправочника,
				НаименованиеЭлемента,
				СсылкаНаОбъект,
				ИмяПользователя
		);
	Исключение
		ПоказатьПредупреждение(, ОписаниеОшибки());
	КонецПопытки;
	
	РаботаСФайламиКлиент.ОбновитьИнтерфейсКнопок(ЭтаФорма, ТекущиеДанные, ИмяТаблицы);
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

    ////////////////////////////////////////////////////////////////////////////////
    // Получение данных на сервере для КомандаУдалить 
	// для передачи в регистр сведений РегистрУдаленияФайлов
	////////////////////////////////////////////////////////////////////////////////
	
	&НаСервере
	Функция ПолучитьДанныеСправочникаНаСервере(СсылкаНаОбъект)
		
		Результат = Новый Структура;
		Результат.Вставить("ИмяСправочника", "");
		Результат.Вставить("Наименование", "");
		Результат.Вставить("Ссылка", "");
		
		Если СсылкаНаОбъект = Неопределено Или СсылкаНаОбъект.Пустая() Тогда
			Возврат Результат;
		КонецЕсли;
		
		Попытка
			// На сервере Метаданные() доступны
			МетаОбъекта = СсылкаНаОбъект.Метаданные();
			Результат.ИмяСправочника = МетаОбъекта.Синоним;
			Результат.Наименование = СсылкаНаОбъект.Наименование;
			Результат.Ссылка = Строка(СсылкаНаОбъект);
		Исключение
			// Если ошибка, заполняем как можем
			Результат.ИмяСправочника = "ЛокальныеАкты-";
			Результат.Наименование = СсылкаНаОбъект.Наименование;
			Результат.Ссылка = Строка(СсылкаНаОбъект);
		КонецПопытки;
		
		Возврат Результат;
		
	КонецФункции
	
		&НаСервере
	Функция ПолучитьИмяСотрудникаНаСервере(СсылкаНаСотрудника)
		
		Если СсылкаНаСотрудника = Неопределено Или СсылкаНаСотрудника.Пустая() Тогда
			Возврат "Система";
		КонецЕсли;
		
		Попытка
			Возврат СсылкаНаСотрудника.Наименование;
		Исключение
			Возврат "Система";
		КонецПопытки;
		
	КонецФункции
	
     ////////////////////////////////////////////////////////////////////////////////


 
// =============================================================================
// ОБРАБОТЧИКИ АКТИВИЗАЦИИ СТРОК (Обновление кнопок при перемещении курсора)
// =============================================================================

&НаКлиенте
Процедура ПриложенияПриАктивизацииСтроки(Элемент)
	РаботаСФайламиКлиент.ОбновитьИнтерфейсКнопок(ЭтаФорма, Элемент.ТекущиеДанные, "Приложения"); 
КонецПроцедуры





// =============================================================================
// ОБНОВЛЕНИЕ ИНТЕРФЕЙСА (Для формы элемента без табличных частей)
// =============================================================================

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Обновляем кнопки при открытии карточки
	ОбновитьКнопкиФайлов();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// Обновляем кнопки после сохранения данных
	ОбновитьКнопкиФайлов();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКнопкиФайлов()
	// Вместо "ВнутренниеДокументы" передаем пустую строку в качестве ТЧ, 
	// так как работаем напрямую с Объектом.
	РаботаСФайламиКлиент.ОбновитьИнтерфейсКнопок(ЭтаФорма, Объект, ""); 
	
	// Принудительная перерисовка
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
